In [2]:
import pandas as pd

ImportError: DLL load failed while importing _multiarray_umath: The specified module could not be found.

ImportError: DLL load failed while importing _multiarray_umath: The specified module could not be found.

In [9]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1= pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [10]:
# display top 3 rows of the dataset

df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [12]:
#check last 3 rows of the dataset
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [19]:
#find shape of the dataset
df1.shape

#shape is not a method but an attribute

(7, 3)

In [25]:
print('Number of rows is',df1.shape[0])

Number of rows is 7

In [26]:
print('Number of columns is', df1.shape[1])

Number of columns is 3

In [27]:
#get information about our dataset
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [46]:
#check null values in the dataset columnwise with axis 0 and rowwise with axis 1

df1.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [47]:
# overall statistics about the data

df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [48]:
#find unique values from the gender column

df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [49]:
#number of unique values from the gender column
df1['Gender'].nunique()

2

In [50]:
#display count of unique values in gender column

df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [61]:
#find total nnumber of students having marks between 90 anad 100 (inclusive) 


df1[(df1['Marks']>=90) & (df1['Marks']<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [66]:
#find total number of students having marks between 90 anad 100 (inclusive) 
#using lenght method


len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

4

In [72]:
#find total number of students having marks between 90 anad 100 (inclusive) 
#using between method


sum(df1['Marks'].between(90,100))

4

In [73]:
#find average marks

round(df1['Marks'].mean())

92

In [74]:
#apply method

def marks(x):
    return x/2

In [77]:
df1['Half_marks']=df1['Marks'].apply(marks)
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [80]:
df1['Half_marks']=df1['Marks'].apply(lambda x:x/2)
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [122]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [87]:
#map function

df1['Male_Female']=df1['Gender'].map({'Male':1, 'Female':0})
df1

      Name  Marks  Gender  Half_marks  Male_Female
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1
5   Mittal     83  Female        41.5            0
6  Archana     99  Female        49.5            0

In [88]:
df1

      Name  Marks  Gender  Half_marks  Male_Female
0  Priyang     98    Male        49.0            1
1   Aadhya     89  Female        44.5            0
2   Krisha     99  Female        49.5            0
3   Vedant     87    Male        43.5            1
4   Parshv     90    Male        45.0            1
5   Mittal     83  Female        41.5            0
6  Archana     99  Female        49.5            0

In [103]:
#droping column(s)

df1.drop(['Male_Female','Half_marks'], axis=1 , inplace =True)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [104]:
df1.columns

#printing column names

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [100]:
df1.index

#indexing

RangeIndex(start=0, stop=7, step=1)

In [112]:
#sort the dataframe as per the marks column

df1.sort_values(by=['Marks','Gender'], ascending =False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [116]:
#display name and marks of the female students

df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [119]:
df1[df1['Gender'].isin(['Female'])]

      Name  Marks  Gender
1   Aadhya     89  Female
2   Krisha     99  Female
5   Mittal     83  Female
6  Archana     99  Female